Autodesk.Revit.ApplicationServices.ProductType
An enumerated type containing the possible Revit product types.

Autodesk.Revit.ApplicationServices.ProductType.Unknown
Unknown.

Autodesk.Revit.ApplicationServices.ProductType.LT
LT.

Autodesk.Revit.ApplicationServices.ProductType.Revit
Revit.

Autodesk.Revit.ApplicationServices.ProductType.MEP
MEP.

Autodesk.Revit.ApplicationServices.ProductType.Structure
Structure.

Autodesk.Revit.ApplicationServices.ProductType.Architecture
Architecture.